ZhuangTao123/nRF52-Beacon-Firmware/examples/ble_peripheral/ble_app_template_user/main.c
#if defined(USE_UICR_FOR_MAJ_MIN_VALUES)
#define MAJ_VAL_OFFSET_IN_BEACON_INFO   18                                      /**< Position of the MSB of the Major Value in m_beacon_info array. */
#define UICR_ADDRESS                    0x10001080                              /**< Address of the UICR register used by this example. The major and minor versions to be encoded into the advertising data will be picked up from this location. */
#endif

#define TX_POWER_LEVEL					-4
#define DEAD_BEEF                       0xDEADBEEF                              /**< Value used as error code on stack dump, can be used to identify stack location on stack unwind. */

#define PASSKEY_TXT                     "Passkey:"                              /**< Message to be displayed together with the pass-key. */
#define PASSKEY_TXT_LENGTH              8                                       /**< Length of message to be displayed together with the pass-key. */
#define PASSKEY_LENGTH                  6                                       /**< Length of pass-key received by the stack for display. */
#define SECURITY_REQUEST_DELAY          APP_TIMER_TICKS(400)                    /**< Delay after connection until Security Request is sent, if necessary (ticks). */


NRF_BLE_GATT_DEF(m_gatt);                                                       /**< GATT module instance. */
BLE_ADVERTISING_DEF(m_advertising);                                             /**< Advertising module instance. */
BLE_BCS_DEF(m_bcs);																/**< Beacon Service instance. */
BLE_TPS_DEF(m_tps);																/**< Tx Power Service instance. */
APP_TIMER_DEF(m_sec_req_timer_id);                                              /**< Security Request timer. */

// Global variables in the application
static pm_peer_id_t m_peer_to_be_deleted 	= PM_PEER_ID_INVALID;
static uint16_t m_conn_handle 				= BLE_CONN_HANDLE_INVALID;                  /**< Handle of the current connection. */
static int8_t	tx_power					= TX_POWER_LEVEL;							/**< Tx Power passed to the program. */
static uint16_t	app_adv_interval 			= APP_ADV_FAST_INTERVAL;					/**< Advertising interval passed to the program. */
static bool 	app_adv_param_update 		= false;
static bool		app_tx_power_param_update 	= false;
static bool		app_flash_update_state 		= false;
static bool		is_bond_deleted				= false;
static bool		is_dfu_disconnect			= false;
static uint8_t	passkey[]					= "703819";

// YOUR_JOB: Use UUIDs for service(s) used in your application.
static ble_uuid_t m_adv_uuids[] =                                               /**< Universally unique service identifiers. */
{
    {BLE_UUID_BCS_SERVICE, BLE_UUID_TYPE_VENDOR_BEGIN}
};

static uint8_t m_beacon_info[APP_BEACON_INFO_LENGTH] =                          /**< Information advertised by the Beacon. */
{
    APP_DEVICE_TYPE,     // Manufacturer specific information. Specifies the device type in this
                         // implementation.
    APP_ADV_DATA_LENGTH, // Manufacturer specific information. Specifies the length of the
                         // manufacturer specific data in this implementation.
    APP_BEACON_UUID,     // 128 bit UUID value.
    APP_MAJOR_VALUE,     // Major arbitrary value that can be used to distinguish between Beacons.
    APP_MINOR_VALUE,     // Minor arbitrary value that can be used to distinguish between Beacons.
    APP_MEASURED_RSSI    // Manufacturer specific information. The Beacon's measured TX power in
                         // this implementation.
};

beacon_conf_flash_t	beacon_conf = 
{
	.uuid_major_minor = {APP_BEACON_UUID, APP_MAJOR_VALUE, APP_MINOR_VALUE},
	.rssi_ref_stored = APP_MEASURED_RSSI,
	.tx_power_stored = TX_POWER_LEVEL,
	.advertising_interval_stored = APP_ADV_FAST_INTERVAL
};

static void advertising_init(void);
static void advertising_start(bool erase_bonds);

/**@brief Handler for shutdown preparation.
 *
 * @details During shutdown procedures, this function will be called at a 1 second interval
 *          untill the function returns true. When the function returns true, it means that the
 *          app is ready to reset to DFU mode.
 *
 * @param[in]   event   Power manager event.
 *
 * @retval  True if shutdown is allowed by this power manager handler, otherwise false.
 */
static bool app_shutdown_handler(nrf_pwr_mgmt_evt_t event)
{
    switch (event)
    {
        case NRF_PWR_MGMT_EVT_PREPARE_DFU:
            NRF_LOG_INFO("Power management wants to reset to DFU mode.");
            // YOUR_JOB: Get ready to reset into DFU mode
            //
            // If you aren't finished with any ongoing tasks, return "false" to
            // signal to the system that reset is impossible at this stage.
            //
            // Here is an example using a variable to delay resetting the device.
            //
            // if (!m_ready_for_reset)
            // {
            //      return false;
            // }
            // else
            //{
            //
            //    // Device ready to enter
            //    uint32_t err_code;
            //    err_code = sd_softdevice_disable();
            //    APP_ERROR_CHECK(err_code);
            //    err_code = app_timer_stop_all();
            //    APP_ERROR_CHECK(err_code);
            //}
            break;

        default:
            // YOUR_JOB: Implement any of the other events available from the power management module:
            //      -NRF_PWR_MGMT_EVT_PREPARE_SYSOFF
            //      -NRF_PWR_MGMT_EVT_PREPARE_WAKEUP
            //      -NRF_PWR_MGMT_EVT_PREPARE_RESET
            return true;
    }

    NRF_LOG_INFO("Power management allowed to reset to DFU mode.");
    return true;
}

//lint -esym(528, m_app_shutdown_handler)
/**@brief Register application shutdown handler with priority 0.
 */
NRF_PWR_MGMT_HANDLER_REGISTER(app_shutdown_handler, 0);

// YOUR_JOB: Update this code if you want to do anything given a DFU event (optional).
/**@brief Function for handling dfu events from the Buttonless Secure DFU service
 *
 * @param[in]   event   Event from the Buttonless Secure DFU service.
 */
static void ble_dfu_evt_handler(ble_dfu_buttonless_evt_type_t event)
{
    switch (event)
    {
        case BLE_DFU_EVT_BOOTLOADER_ENTER_PREPARE:
            NRF_LOG_INFO("Device is preparing to enter bootloader mode.");
            // YOUR_JOB: Disconnect all bonded devices that currently are connected.
            //           This is required to receive a service changed indication
            //           on bootup after a successful (or aborted) Device Firmware Update.
            
            is_dfu_disconnect = true;
            break;

        case BLE_DFU_EVT_BOOTLOADER_ENTER:
            // YOUR_JOB: Write app-specific unwritten data to FLASH, control finalization of this
            //           by delaying reset by reporting false in app_shutdown_handler
            NRF_LOG_INFO("Device will enter bootloader mode.");
            break;

        case BLE_DFU_EVT_BOOTLOADER_ENTER_FAILED:
            NRF_LOG_ERROR("Request to enter bootloader mode failed asynchroneously.");
            // YOUR_JOB: Take corrective measures to resolve the issue
            //           like calling APP_ERROR_CHECK to reset the device.
            is_dfu_disconnect = false;
            break;

