ZhuangTao123/nRF52-Beacon-Firmware/examples/ble_peripheral/ble_app_template_user/main.c
/**@brief Function for handling the Security Request timer timeout.
 *
 * @details This function will be called each time the Security Request timer expires.
 *
 * @param[in] p_context  Pointer used for passing some arbitrary information (context) from the
 *                       app_start_timer() call to the timeout handler.
 */
static void sec_req_timeout_handler(void * p_context)
{
    ret_code_t err_code;

    if (m_conn_handle != BLE_CONN_HANDLE_INVALID)
    {
        // Initiate bonding.
        NRF_LOG_DEBUG("Start encryption");
        err_code = pm_conn_secure(m_conn_handle, false);
        if (err_code != NRF_ERROR_INVALID_STATE)
        {
            APP_ERROR_CHECK(err_code);
        }
    }
}

/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module. This creates and starts application timers.
 */
static void timers_init(void)
{
    // Initialize timer module.
    ret_code_t err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);

    // Create timers.

    // Create Security Request timer.
    err_code = app_timer_create(&m_sec_req_timer_id,
                                APP_TIMER_MODE_SINGLE_SHOT,
                                sec_req_timeout_handler);
    APP_ERROR_CHECK(err_code);

}


/**@brief Function for the GAP initialization.
 *
 * @details This function sets up all the necessary GAP (Generic Access Profile) parameters of the
 *          device including the device name, appearance, and the preferred connection parameters.
 */
static void gap_params_init(void)
{
    ret_code_t              err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;
	ble_opt_t				ble_opt;

    //BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);
    BLE_GAP_CONN_SEC_MODE_SET_ENC_WITH_MITM(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *)DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    /* YOUR_JOB: Use an appearance value matching the application's use case.
       err_code = sd_ble_gap_appearance_set(BLE_APPEARANCE_);
       APP_ERROR_CHECK(err_code); */
    ble_opt.gap_opt.passkey.p_passkey = &passkey[0];

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);

	err_code = sd_ble_opt_set(BLE_GAP_OPT_PASSKEY, &ble_opt);
	APP_ERROR_CHECK(err_code);

	// Retrieved tx power value from flash/default configuration.
	tx_power = beacon_conf.tx_power_stored;
	err_code = sd_ble_gap_tx_power_set(tx_power);
	APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the GATT module.
 */
static void gatt_init(void)
{
    ret_code_t err_code = nrf_ble_gatt_init(&m_gatt, NULL);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the data from the Beacon Service.
 *
 * @details This function will process the data received from the Beacon BLE Service
 *
 * @param[in] p_evt    Beacon Service event structure.
 */
/**@snippet [Handling the data received over BLE] */
static void bcs_data_handler(ble_bcs_evt_t * p_evt)
{
	uint8_t   * p_data = NULL;
	uint16_t 	data_len = p_evt->params.rx_data.length;

    if (p_evt->type == BLE_BCS_EVT_ADV_RX_DATA && data_len == 21)
    {
    	p_data = (uint8_t *)p_evt->params.rx_data.p_data;
    	memcpy(&m_beacon_info[2], p_data, 21);
		memcpy(&beacon_conf.uuid_major_minor, p_data, 21);
		app_adv_param_update = true;
		app_flash_update_state = true;
    }
	else if(p_evt->type == BLE_BCS_EVT_ADVINT_RX_DATA && data_len == sizeof(uint16_t))
	{
		p_data = (uint8_t *)p_evt->params.rx_data.p_data;
		app_adv_interval = (uint16_t)(*(p_data+1) << 8) + *p_data;
		beacon_conf.advertising_interval_stored = app_adv_interval;
		app_adv_param_update = true;
		app_flash_update_state = true;
	}
	else
	{
		app_adv_param_update = false;
		// Nothing to do here.
	}
	p_data = NULL;

}

static void tps_data_handler(ble_tps_evt_t * p_evt)
{
	uint8_t * p_data = NULL;
	uint8_t   data_len = p_evt->params.rx_data.length;

	if(p_evt->evt_type == BLE_TPS_EVT_POWER_CHANGE && data_len == 1)
	{
		p_data = (uint8_t *)p_evt->params.rx_data.p_data;
		tx_power = (int8_t)*p_data;
		beacon_conf.tx_power_stored = tx_power;
		app_tx_power_param_update = true;
		app_flash_update_state = true;
	}
	else
	{
		app_tx_power_param_update = false;
		// Do nothing here.
	}
	p_data = NULL;
}

/**@brief Function for initializing services that will be used by the application.
 */
static void services_init(void)
{
	ret_code_t			err_code;
    ble_bcs_init_t		bcs_init;
	ble_tps_init_t		tps_init;
	ble_dfu_buttonless_init_t dfus_init =
    {
        .evt_handler = ble_dfu_evt_handler
    };

	// Initialize Beacon Service
	memset(&bcs_init, 0, sizeof(bcs_init));

	bcs_init.init_advint_value = app_adv_interval;
	bcs_init.data_handler = bcs_data_handler;

	err_code = ble_bcs_init(&m_bcs, &bcs_init);
	APP_ERROR_CHECK(err_code);

	// Initialize Tx Power Service
	memset(&tps_init, 0, sizeof(tps_init));

	tps_init.initial_tx_power_level = tx_power;
	tps_init.data_handler = tps_data_handler;
	
	BLE_GAP_CONN_SEC_MODE_SET_ENC_WITH_MITM(&tps_init.tps_attr_md.read_perm);
	BLE_GAP_CONN_SEC_MODE_SET_ENC_WITH_MITM(&tps_init.tps_attr_md.write_perm);

	err_code = ble_tps_init(&m_tps, &tps_init);
	APP_ERROR_CHECK(err_code);

	// Initialize the async SVCI interface to bootloader.
    err_code = ble_dfu_buttonless_async_svci_init();
    APP_ERROR_CHECK(err_code);


    err_code = ble_dfu_buttonless_init(&dfus_init);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the Connection Parameters Module.
 *
 * @details This function will be called for all events in the Connection Parameters Module which
 *          are passed to the application.
 *          @note All this function does is to disconnect. This could have been done by simply
 *                setting the disconnect_on_fail config parameter, but instead we use the event
 *                handler mechanism to demonstrate its use.
 *
 * @param[in] p_evt  Event received from the Connection Parameters Module.
 */
static void on_conn_params_evt(ble_conn_params_evt_t * p_evt)
{
    ret_code_t err_code;

